; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared2 - mode
	image3 - mode
	spectrograph1 - mode
	infrared0 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star2 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Star5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 155)
	(= (data Star5 infrared2) 40)
	(= (data Phenomenon6 infrared2) 275)
	(= (data Phenomenon7 infrared2) 4)
	(= (data Phenomenon8 infrared2) 276)
	(= (data Planet9 infrared2) 228)
	(= (data Phenomenon10 infrared2) 300)
	(= (data Phenomenon11 infrared2) 13)
	(= (data Planet12 infrared2) 243)
	(= (data Star5 image3) 278)
	(= (data Phenomenon6 image3) 34)
	(= (data Phenomenon7 image3) 101)
	(= (data Phenomenon8 image3) 182)
	(= (data Planet9 image3) 209)
	(= (data Phenomenon10 image3) 181)
	(= (data Phenomenon11 image3) 168)
	(= (data Planet12 image3) 42)
	(= (data Star5 spectrograph1) 128)
	(= (data Phenomenon6 spectrograph1) 9)
	(= (data Phenomenon7 spectrograph1) 193)
	(= (data Phenomenon8 spectrograph1) 136)
	(= (data Planet9 spectrograph1) 58)
	(= (data Phenomenon10 spectrograph1) 186)
	(= (data Phenomenon11 spectrograph1) 25)
	(= (data Planet12 spectrograph1) 289)
	(= (data Star5 infrared0) 251)
	(= (data Phenomenon6 infrared0) 90)
	(= (data Phenomenon7 infrared0) 59)
	(= (data Phenomenon8 infrared0) 58)
	(= (data Planet9 infrared0) 15)
	(= (data Phenomenon10 infrared0) 167)
	(= (data Phenomenon11 infrared0) 169)
	(= (data Planet12 infrared0) 138)
	(= (slew_time GroundStation1 GroundStation0) 25.95)
	(= (slew_time GroundStation0 GroundStation1) 25.95)
	(= (slew_time Star2 GroundStation0) 0.967)
	(= (slew_time GroundStation0 Star2) 0.967)
	(= (slew_time Star2 GroundStation1) 86.91)
	(= (slew_time GroundStation1 Star2) 86.91)
	(= (slew_time GroundStation4 GroundStation0) 58.03)
	(= (slew_time GroundStation0 GroundStation4) 58.03)
	(= (slew_time GroundStation4 GroundStation1) 1.141)
	(= (slew_time GroundStation1 GroundStation4) 1.141)
	(= (slew_time GroundStation4 Star2) 75.41)
	(= (slew_time Star2 GroundStation4) 75.41)
	(= (slew_time GroundStation4 GroundStation3) 36.23)
	(= (slew_time GroundStation3 GroundStation4) 36.23)
	(= (slew_time GroundStation3 GroundStation0) 4.442)
	(= (slew_time GroundStation0 GroundStation3) 4.442)
	(= (slew_time GroundStation3 GroundStation1) 0.1898)
	(= (slew_time GroundStation1 GroundStation3) 0.1898)
	(= (slew_time GroundStation3 Star2) 35.5)
	(= (slew_time Star2 GroundStation3) 35.5)
	(= (slew_time Star5 GroundStation0) 70.86)
	(= (slew_time GroundStation0 Star5) 70.86)
	(= (slew_time Star5 GroundStation1) 1.906)
	(= (slew_time GroundStation1 Star5) 1.906)
	(= (slew_time Star5 Star2) 16.55)
	(= (slew_time Star2 Star5) 16.55)
	(= (slew_time Star5 GroundStation3) 20.88)
	(= (slew_time GroundStation3 Star5) 20.88)
	(= (slew_time Star5 GroundStation4) 41.31)
	(= (slew_time GroundStation4 Star5) 41.31)
	(= (slew_time Phenomenon6 GroundStation0) 5.165)
	(= (slew_time GroundStation0 Phenomenon6) 5.165)
	(= (slew_time Phenomenon6 GroundStation1) 19.32)
	(= (slew_time GroundStation1 Phenomenon6) 19.32)
	(= (slew_time Phenomenon6 Star2) 27.17)
	(= (slew_time Star2 Phenomenon6) 27.17)
	(= (slew_time Phenomenon6 GroundStation3) 15.12)
	(= (slew_time GroundStation3 Phenomenon6) 15.12)
	(= (slew_time Phenomenon6 GroundStation4) 63.93)
	(= (slew_time GroundStation4 Phenomenon6) 63.93)
	(= (slew_time Phenomenon6 Star5) 80.91)
	(= (slew_time Star5 Phenomenon6) 80.91)
	(= (slew_time Phenomenon7 GroundStation0) 31.05)
	(= (slew_time GroundStation0 Phenomenon7) 31.05)
	(= (slew_time Phenomenon7 GroundStation1) 40.42)
	(= (slew_time GroundStation1 Phenomenon7) 40.42)
	(= (slew_time Phenomenon7 Star2) 65.24)
	(= (slew_time Star2 Phenomenon7) 65.24)
	(= (slew_time Phenomenon7 GroundStation3) 33.07)
	(= (slew_time GroundStation3 Phenomenon7) 33.07)
	(= (slew_time Phenomenon7 GroundStation4) 13.65)
	(= (slew_time GroundStation4 Phenomenon7) 13.65)
	(= (slew_time Phenomenon7 Star5) 52.83)
	(= (slew_time Star5 Phenomenon7) 52.83)
	(= (slew_time Phenomenon7 Phenomenon6) 72.81)
	(= (slew_time Phenomenon6 Phenomenon7) 72.81)
	(= (slew_time Phenomenon8 GroundStation0) 7.789)
	(= (slew_time GroundStation0 Phenomenon8) 7.789)
	(= (slew_time Phenomenon8 GroundStation1) 22.61)
	(= (slew_time GroundStation1 Phenomenon8) 22.61)
	(= (slew_time Phenomenon8 Star2) 27.35)
	(= (slew_time Star2 Phenomenon8) 27.35)
	(= (slew_time Phenomenon8 GroundStation3) 31.64)
	(= (slew_time GroundStation3 Phenomenon8) 31.64)
	(= (slew_time Phenomenon8 GroundStation4) 2.548)
	(= (slew_time GroundStation4 Phenomenon8) 2.548)
	(= (slew_time Phenomenon8 Star5) 53.54)
	(= (slew_time Star5 Phenomenon8) 53.54)
	(= (slew_time Phenomenon8 Phenomenon6) 73.93)
	(= (slew_time Phenomenon6 Phenomenon8) 73.93)
	(= (slew_time Phenomenon8 Phenomenon7) 41.43)
	(= (slew_time Phenomenon7 Phenomenon8) 41.43)
	(= (slew_time Planet9 GroundStation0) 53.42)
	(= (slew_time GroundStation0 Planet9) 53.42)
	(= (slew_time Planet9 GroundStation1) 68.44)
	(= (slew_time GroundStation1 Planet9) 68.44)
	(= (slew_time Planet9 Star2) 21.85)
	(= (slew_time Star2 Planet9) 21.85)
	(= (slew_time Planet9 GroundStation3) 16.91)
	(= (slew_time GroundStation3 Planet9) 16.91)
	(= (slew_time Planet9 GroundStation4) 32.42)
	(= (slew_time GroundStation4 Planet9) 32.42)
	(= (slew_time Planet9 Star5) 34.26)
	(= (slew_time Star5 Planet9) 34.26)
	(= (slew_time Planet9 Phenomenon6) 44.71)
	(= (slew_time Phenomenon6 Planet9) 44.71)
	(= (slew_time Planet9 Phenomenon7) 67.32)
	(= (slew_time Phenomenon7 Planet9) 67.32)
	(= (slew_time Planet9 Phenomenon8) 33.5)
	(= (slew_time Phenomenon8 Planet9) 33.5)
	(= (slew_time Phenomenon10 GroundStation0) 91.72)
	(= (slew_time GroundStation0 Phenomenon10) 91.72)
	(= (slew_time Phenomenon10 GroundStation1) 80.37)
	(= (slew_time GroundStation1 Phenomenon10) 80.37)
	(= (slew_time Phenomenon10 Star2) 41.08)
	(= (slew_time Star2 Phenomenon10) 41.08)
	(= (slew_time Phenomenon10 GroundStation3) 1.609)
	(= (slew_time GroundStation3 Phenomenon10) 1.609)
	(= (slew_time Phenomenon10 GroundStation4) 81.76)
	(= (slew_time GroundStation4 Phenomenon10) 81.76)
	(= (slew_time Phenomenon10 Star5) 63.3)
	(= (slew_time Star5 Phenomenon10) 63.3)
	(= (slew_time Phenomenon10 Phenomenon6) 34.3)
	(= (slew_time Phenomenon6 Phenomenon10) 34.3)
	(= (slew_time Phenomenon10 Phenomenon7) 29.44)
	(= (slew_time Phenomenon7 Phenomenon10) 29.44)
	(= (slew_time Phenomenon10 Phenomenon8) 55.49)
	(= (slew_time Phenomenon8 Phenomenon10) 55.49)
	(= (slew_time Phenomenon10 Planet9) 65.53)
	(= (slew_time Planet9 Phenomenon10) 65.53)
	(= (slew_time Phenomenon11 GroundStation0) 5.386)
	(= (slew_time GroundStation0 Phenomenon11) 5.386)
	(= (slew_time Phenomenon11 GroundStation1) 54.69)
	(= (slew_time GroundStation1 Phenomenon11) 54.69)
	(= (slew_time Phenomenon11 Star2) 26.07)
	(= (slew_time Star2 Phenomenon11) 26.07)
	(= (slew_time Phenomenon11 GroundStation3) 53.43)
	(= (slew_time GroundStation3 Phenomenon11) 53.43)
	(= (slew_time Phenomenon11 GroundStation4) 38)
	(= (slew_time GroundStation4 Phenomenon11) 38)
	(= (slew_time Phenomenon11 Star5) 12.34)
	(= (slew_time Star5 Phenomenon11) 12.34)
	(= (slew_time Phenomenon11 Phenomenon6) 27.94)
	(= (slew_time Phenomenon6 Phenomenon11) 27.94)
	(= (slew_time Phenomenon11 Phenomenon7) 15.39)
	(= (slew_time Phenomenon7 Phenomenon11) 15.39)
	(= (slew_time Phenomenon11 Phenomenon8) 71.37)
	(= (slew_time Phenomenon8 Phenomenon11) 71.37)
	(= (slew_time Phenomenon11 Planet9) 25.07)
	(= (slew_time Planet9 Phenomenon11) 25.07)
	(= (slew_time Phenomenon11 Phenomenon10) 18.98)
	(= (slew_time Phenomenon10 Phenomenon11) 18.98)
	(= (slew_time Planet12 GroundStation0) 16.98)
	(= (slew_time GroundStation0 Planet12) 16.98)
	(= (slew_time Planet12 GroundStation1) 66.55)
	(= (slew_time GroundStation1 Planet12) 66.55)
	(= (slew_time Planet12 Star2) 67.43)
	(= (slew_time Star2 Planet12) 67.43)
	(= (slew_time Planet12 GroundStation3) 6.719)
	(= (slew_time GroundStation3 Planet12) 6.719)
	(= (slew_time Planet12 GroundStation4) 55.49)
	(= (slew_time GroundStation4 Planet12) 55.49)
	(= (slew_time Planet12 Star5) 27.33)
	(= (slew_time Star5 Planet12) 27.33)
	(= (slew_time Planet12 Phenomenon6) 48.96)
	(= (slew_time Phenomenon6 Planet12) 48.96)
	(= (slew_time Planet12 Phenomenon7) 67.51)
	(= (slew_time Phenomenon7 Planet12) 67.51)
	(= (slew_time Planet12 Phenomenon8) 51.1)
	(= (slew_time Phenomenon8 Planet12) 51.1)
	(= (slew_time Planet12 Planet9) 9.182)
	(= (slew_time Planet9 Planet12) 9.182)
	(= (slew_time Planet12 Phenomenon10) 30.72)
	(= (slew_time Phenomenon10 Planet12) 30.72)
	(= (slew_time Planet12 Phenomenon11) 35.44)
	(= (slew_time Phenomenon11 Planet12) 35.44)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Star2)
	(have_image Star5 infrared0)
	(have_image Phenomenon7 spectrograph1)
	(have_image Phenomenon8 spectrograph1)
	(have_image Phenomenon10 infrared0)
	(have_image Phenomenon11 spectrograph1)
))
(:metric minimize (fuel-used))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (turn_to satellite0 groundstation1 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 155 to 153.094, (fuel-used) from 0 to 1.906
   goals met: 0 of 6
3. (turn_to satellite0 star5 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 153.094 to 151.188, (fuel-used) from 1.906 to 3.812
   goals met: 0 of 6
4. (turn_to satellite0 groundstation4 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation4)
   changed: (fuel satellite0) from 151.188 to 109.878, (fuel-used) from 3.812 to 45.122
   goals met: 0 of 6
5. (turn_to satellite0 groundstation3 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 109.878 to 73.648, (fuel-used) from 45.122 to 81.352
   goals met: 0 of 6
6. (turn_to satellite0 phenomenon10 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon10)
   changed: (fuel satellite0) from 73.648 to 72.039, (fuel-used) from 81.352 to 82.961
   goals met: 0 of 6
7. (turn_to satellite0 groundstation3 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 72.039 to 70.43, (fuel-used) from 82.961 to 84.57
   goals met: 0 of 6
8. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 0 of 6
9. (turn_to satellite0 phenomenon10 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon10)
   changed: (fuel satellite0) from 70.43 to 68.821, (fuel-used) from 84.57 to 86.179
   goals met: 0 of 6
10. (take_image satellite0 phenomenon10 instrument0 infrared0)
   added: (have_image phenomenon10 infrared0)
   changed: (data_capacity satellite0) from 1000 to 833, (data-stored) from 0 to 167
   goals met: 1 of 6
11. (turn_to satellite0 groundstation3 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 68.821 to 67.212, (fuel-used) from 86.179 to 87.788
   goals met: 1 of 6
12. (turn_to satellite0 groundstation1 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 67.212 to 67.0222, (fuel-used) from 87.788 to 87.9778
   goals met: 1 of 6
13. (turn_to satellite0 star5 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 67.0222 to 65.1162, (fuel-used) from 87.9778 to 89.8838
   goals met: 1 of 6
14. (take_image satellite0 star5 instrument0 infrared0)
   added: (have_image star5 infrared0)
   changed: (data_capacity satellite0) from 833 to 582, (data-stored) from 167 to 418
   goals met: 2 of 6
15. (turn_to satellite0 phenomenon11 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon11)
   changed: (fuel satellite0) from 65.1162 to 52.7762, (fuel-used) from 89.8838 to 102.224
   goals met: 2 of 6
16. (take_image satellite0 phenomenon11 instrument0 spectrograph1)
   added: (have_image phenomenon11 spectrograph1)
   changed: (data_capacity satellite0) from 582 to 557, (data-stored) from 418 to 443
   goals met: 3 of 6
17. (turn_to satellite0 phenomenon7 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 52.7762 to 37.3862, (fuel-used) from 102.224 to 117.614
   goals met: 3 of 6
18. (take_image satellite0 phenomenon7 instrument0 spectrograph1)
   added: (have_image phenomenon7 spectrograph1)
   changed: (data_capacity satellite0) from 557 to 364, (data-stored) from 443 to 636
   goals met: 4 of 6
19. (turn_to satellite0 groundstation4 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 groundstation4)
   changed: (fuel satellite0) from 37.3862 to 23.7362, (fuel-used) from 117.614 to 131.264
   goals met: 4 of 6
20. (turn_to satellite0 phenomenon8 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 23.7362 to 21.1882, (fuel-used) from 131.264 to 133.812
   goals met: 4 of 6
21. (take_image satellite0 phenomenon8 instrument0 spectrograph1)
   added: (have_image phenomenon8 spectrograph1)
   changed: (data_capacity satellite0) from 364 to 228, (data-stored) from 636 to 772
   goals met: 5 of 6
22. (turn_to satellite0 groundstation0 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 21.1882 to 13.3992, (fuel-used) from 133.812 to 141.601
   goals met: 5 of 6
23. (turn_to satellite0 star2 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 13.3992 to 12.4322, (fuel-used) from 141.601 to 142.568
   goals met: 6 of 6
